{
  "source_url": "https://www.artsci.utoronto.ca/events",
  "total_items": 9,
  "items": [
    {
      "Name": "Pop Up Cinematheque: The Naked Island",
      "URL": "https://www.artsci.utoronto.ca/events/pop-cinematheque-naked-island",
      "detailed_info": {
        "title": "Pop Up Cinematheque: The Naked Island",
        "description": "POP-UP CINEMATHEQUE presents THE NAKED ISLAND on 16mm film with an introduction by programmer, projectionist and musician Thomas Chan. The Naked Island (裸の島) is a Japanese black-and-white film from 1960, directed by Kaneto Shindō. The film is notable for having almost no spoken dialogue. Join us on Monday, December 2, 2024, 6:30 PM Media Commons Theatre, Robarts Library, 130 St George St, Toronto, ON M5S 1A5. Admission is free but registration is required because Robarts Library is not open to the general public - no rush tickets are available. All are welcome but non-UofT audience members must have tickets on hand to show to Robarts Library security. POP-UP CINEMATHEQUE, presented by The Cinema Studies Institute and Media Commons Archives, is a new 16mm screening series highlighting rare gems from the collections. Each screening features an introductory talk discussing the unique aspects of the film and its archival status. Note: Event details can change. Please visit the unit’s website for the latest information about this event.",
        "date": "Monday, December 02, 2024 6:30 pm to 8:30 pm",
        "location": "Media Commons Theatre Robarts Library 130 St George St, Toronto, ON M5S 1A5"
      }
    },
    {
      "Name": "Sustainable Fashion Series Part 1: Clothing Swap and DIY Tote Bag Workshop",
      "URL": "https://www.artsci.utoronto.ca/events/sustainable-fashion-series-part-1-clothing-swap-and-diy-tote-bag-workshop",
      "detailed_info": {
        "title": "Sustainable Fashion Series Part 1: Clothing Swap and DIY Tote Bag Workshop",
        "description": "The School of the Environment and the Environmental Students' Union (ENSU) invite you to attend Part 1 of our Sustainable Fashion Series. At the Clothing Swap and DIY Tote Bag Workshop attendees are invited to decorate their own tote bag and bring their clothes to swap with other attendees at the event. Please note that materials for the DIY Tote Bag Workshop will be provided to all attendees. Supplies are limited and will be distributed on a first come first served basis. The event will be held on Wednesday, December 4th, 2024, from 4:00 pm - 6:00 pm in ES 1042 (5 Bancroft Avenue). Attendees interested in participating in the clothing swap are encouraged to drop off their clothes at the School of the Environment's administrative offices at ES1016V (33 Willcocks Street) on Friday, November 29th from 11:00 am - 3:00 pm. Attendees can also bring their clothes to swap the day of the event. Please limit number of drop-off items to 10 per person. Note: Event details can change. Please visit the unit’s website for the latest information about this event.",
        "date": "Wednesday, December 04, 2024",
        "location": "ES 1042 Earth Sciences Centre, 5 Bancroft Ave, Toronto, ON M5S 3J1"
      }
    },
    {
      "Name": "Innis College Refugee Student Fund Benefit Concert",
      "URL": "https://www.artsci.utoronto.ca/events/innis-college-refugee-student-fund-benefit-concert",
      "detailed_info": {
        "title": "Innis College Refugee Student Fund Benefit Concert",
        "description": "On December 5, please join us for the eighth annual Refugee Student Fund Benefit Concert, featuring musical and dance performances by students, staff, and alumni of Innis College. All proceeds from this event directly support resettled refugees in their upper years of study at Innis College. A donation to the Innis College Refugee Student Fund is encouraged (suggested minimum of $20). If you are a current Innis College or U of T student looking to attend and support your classmates, a donation is not required. Note: Event details can change. Please visit the unit’s website for the latest information about this event.",
        "date": "Thursday, December 05, 2024 1:00 pm to 3:00 pm",
        "location": "Innis Town Hall, Innis College, 2 Sussex Ave, Toronto, ON M5S 1J5"
      }
    },
    {
      "Name": "Annual Bennett Lecture: Margot E. Fassler",
      "URL": "https://www.artsci.utoronto.ca/events/annual-bennett-lecture-margot-e-fassler",
      "detailed_info": {
        "title": "Annual Bennett Lecture: Margot E. Fassler",
        "description": "This year's PIMS / CMS W. John Bennett Distinguished Visiting Scholar, Margot Fassler (Keough-Hesburgh Professor Emerita of Music History and Liturgy, University of Notre Dame and Robert Tangeman Professor Emerita of Music History, Yale University) presents: \"The Poor Clares of Villingen: Music, Liturgy and Art in an Enclosed Convent.\" Attend in person at Alumni Hall, OR virtually via ZOOM. Note: Event details can change. Please visit the unit’s website for the latest information about this event.",
        "date": "Friday, December 06, 2024 4:00 pm to 6:00 pm",
        "location": "400 Muzzo Family Alumni Hall 121 St. Joseph Street, Toronto, ON, M5S 3C2"
      }
    },
    {
      "Name": "Pop Up Cinematheque: Moving Mountains & Yes, We Can!",
      "URL": "https://www.artsci.utoronto.ca/events/pop-cinematheque-moving-mountains-yes-we-can",
      "detailed_info": {
        "title": "Pop Up Cinematheque: Moving Mountains & Yes, We Can!",
        "description": "POP-UP CINEMATHEQUE presents MOVING MOUNTAINS and YES, WE CAN! on 16mm film with an introduction by Media Commons Archivist Rachel E. Beattie. Moving Mountains is a 1980 short documentary directed by Laura Sky about the lives of the first women to mine coal in Canada. Yes, We Can! is a 1984 documentary produced by the Canadian Union of Public Employees that traces the experiences of women in the CUPE union. Join us on Monday, December 9, 2024, 6:30 PM. Media Commons Theatre, Robarts Library, 130 St George St, Toronto, ON M5S 1A5. Admission is free but registration is required because Robarts Library is not open to the general public - no rush tickets are available. All are welcome but non-UofT audience members must have tickets on hand to show to Robarts Library security. POP-UP CINEMATHEQUE, presented by The Cinema Studies Institute and Media Commons Archives, is a new 16mm screening series highlighting rare gems from the collections. Each screening features an introductory talk discussing the unique aspects of the film and its archival status. Note: Event details can change.",
        "date": "Monday, December 09, 2024 6:30 pm to 8:30 pm",
        "location": "Media Commons Theatre Robarts Library 130 St George St, Toronto, ON M5S 1A5"
      }
    },
    {
      "Name": "Pop Up Cinematheque: Bringing Up Baby",
      "URL": "https://www.artsci.utoronto.ca/events/pop-cinematheque-bringing-baby",
      "detailed_info": {
        "title": "Pop Up Cinematheque: Bringing Up Baby",
        "description": "Bringing Up Baby is a 1938 American screwball comedy film directed by Howard Hawks, and starring Katharine Hepburn and Cary Grant. Join us on Monday, December 16, 2024, 6:30 PM. Media Commons Theatre, Robarts Library, 130 St George St, Toronto, ON M5S 1A5. Admission is free but registration is required because Robarts Library is not open to the general public - no rush tickets are available. All are welcome but non-UofT audience members must have tickets on hand to show to Robarts Library security. POP-UP CINEMATHEQUE, presented by The Cinema Studies Institute and Media Commons Archives, is a new 16mm screening series highlighting rare gems from the collections. Each screening features an introductory talk discussing the unique aspects of the film and its archival status. Keep an eye out for more screenings in the spring! Note: Event details can change.",
        "date": "Monday, December 16, 2024 6:30 pm to 8:30 pm",
        "location": "Media Commons Theatre Robarts Library 130 St George St, Toronto, ON M5S 1A5"
      }
    },
    {
      "Name": "Speaker Series: Office for Human Mobility: How North American policy collaborations could facilitate mo...",
      "URL": "https://www.artsci.utoronto.ca/events/speaker-series-office-human-mobility-how-north-american-policy-collaborations-could",
      "detailed_info": {
        "title": "Speaker Series: Office for Human Mobility: How North American policy collaborations could facilitate moving and staying in a post-NAFTA era with Professor Alyshia Gálvez",
        "description": "About the lecture: Most conceptualizations of borders and migration center the perspective of states and are inadequate to understand, predict or facilitate how people work with and around policies. The intertwining of some aspects of North American economies with NAFTA, and later the USMCA prompted and yet were incapable of handling the massive displacements they generated. While it may be true the solution lies outside of trade deals, and even nation states, with the ethical response an elimination of borders, this talk will focus in the meantime on the potential for more creative and humanitarian responses within the existing policy frameworks, an anti-NAFTA within the existing tri-national policy environment. Centering lived experiences of those directly impacted by NAFTA will enable better, more grounded policy design, even while acknowledging that the existing national policy landscapes continue to generate and sustain structural inequalities and harm.",
        "date": "Thursday, January 30, 2025 3:30 pm to 4:00 pm",
        "location": "Room 100 Jackman Humanities Building 170 St. George St. Toronto, ON M5R 2M8"
      }
    },
    {
      "Name": "Hult Prize 2025 OnCampus Competition",
      "URL": "https://www.artsci.utoronto.ca/events/hult-prize-2025-oncampus-competition",
      "detailed_info": {
        "title": "Hult Prize 2025 OnCampus Competition",
        "description": "Think your idea is worth $1M USD? The Hult Prize OnCampus competition returns to U of T on February 12. Each year, Hult Prize empowers students all around the world to create innovative startups that can create real impact. Participants join an exclusive global community of student entrepreneurs, mentors, and industry experts as they work to earn a spot in our Global Finals where finalists compete for $1M in funding to bring their big ideas to life. Whether you’re looking to take your existing startup to the next level or are inspired to build a brand new business, we invite you to participate. REGISTRATION DEADLINE: Sunday, January 19th, 2025 at 11:59 PM Learn more at uoft.me/HultPrize Note: Event details can change. Please visit the unit’s website for the latest information about this event.",
        "date": "Wednesday, February 12, 2025 1:00 pm to 4:00 pm",
        "location": "10th Floor - West Winter Gardens Schwartz Reisman Innovation Campus 108 College Street, Toronto, ON M5G 1l7"
      }
    },
    {
      "Name": "2025 CrimSL Graduate Student Conference: The Politics of Resistance and Belonging",
      "URL": "https://www.artsci.utoronto.ca/events/2025-crimsl-graduate-student-conference-politics-resistance-and-belonging",
      "detailed_info": {
        "title": "2025 CrimSL Graduate Student Conference: The Politics of Resistance and Belonging",
        "description": "We are pleased to announce that the 2025 Graduate Student Conference at the University of Toronto's Centre for Criminology and Sociolegal Studies will take place in person on April 25, 2025. This year’s theme is The Politics of Resistance & Belonging. The purpose of the conference is to shed a unique light on the nature of resistance, how it relates to belonging and other terms like solidarity, resilience, and rebellion, engage in conversations about coercive powers of exclusion, use of violent measures, and consider the tensions and conflicting messages that exist when people engage in resistance and are subjected to criminalization. We welcome both artistic and paper presentation submissions from criminology, sociolegal studies, sociology, law, psychology, history, science and technology studies, anthropology, public policy, geography, and related disciplines. Submission deadline: December 20, 2024 Registration Opens: December 12, 2024 Notification of selection: January 10, 2025 Conference date: April 25, 2025 Note: Event details can change. Please visit the unit’s website for the latest information about this event.",
        "date": "Friday, April 25, 2025",
        "location": "Canadiana Gallery 14 Queen’s Park Crescent West, Toronto, ON Canada M5S 3K9"
      }
    }
  ]
}