{
  "source_url": "https://www.utoronto.ca/events",
  "total_items": 79,
  "items": [
    {
      "Name": "BLACK STUDENT ENGAGEMENT The Link Up",
      "URL": "https://www.utsc.utoronto.ca/webapps/webforms/feeds/displayDetails?id=3&event_id=7838",
      "detailed_info": {
        "title": "BSE - \"Let's Talk\" - The Link Up",
        "description": "Join us for a meal and conversation. A space for black identifying students of Caribbean, West Indian and African decent or origin to meet, network, talk, unpack, learn and discuss social and global issues. Be a part of your community.",
        "date": "Thursday, November 28, 2024, 04:30 pm - 07:00 pm",
        "location": "MW 130"
      }
    },
    {
      "Name": "(VIRTUAL) Lime Connect - Business/Finance Recruitment Reception",
      "URL": "https://www.utsc.utoronto.ca/webapps/webforms/feeds/displayDetails?id=1&event_id=8208",
      "detailed_info": {
        "title": "Virtual Information Session - Business/Finance Recruitment Reception",
        "description": "A virtual Business/Finance-focused recruitment event for early/experienced professionals with disabilities. Registration is now open! Register to attend by Thursday, November 21st at midnight PST. A recruitment opportunity designed with visible and non-visible disabilities in mind. Our partners Bell, Canada Life, CIBC, Deloitte, IBM Canada, OMERS, PwC Canada, Rogers, and TD are seeking to connect with Lime Network members for outstanding opportunities available for professionals at all stages of their career!! All candidates must register in advance via our online system for these events to be considered. Please Note that this is an External Info Session hosted by Lime Connect.",
        "date": "Thursday, November 28th 2024",
        "location": "Virtual"
      }
    },
    {
      "Name": "Rapid Resume Review: In-Person Drop-in",
      "URL": "https://www.utsc.utoronto.ca/webapps/webforms/feeds/displayDetails?id=1&event_id=8322",
      "detailed_info": {
        "title": "Rapid Resume Review: In-Person Drop-in",
        "description": "Rapid Resume Review is back at our new location at Sam Ibrahim Building, 5th Floor, IA5165. Meet Employment Peer Coaches & Get Your Resume Reviewed! In-person drop-in service. No appointment necessary. Get quick feedback on your resume, cover letter or LinkedIn profile. Bring a paper copy of your resume or cover letter to get it reviewed quickly!",
        "date": "November 28, 2024, 11:00 am - 01:00 pm",
        "location": "Sam Ibrahim Building, 5th Floor, IA5165"
      }
    },
    {
      "Name": "Strollin'",
      "URL": "https://www.uc.utoronto.ca/events/strollin",
      "detailed_info": {
        "title": "Strollin'",
        "description": "Join us for an evening talking about walking. Shawn Micallef, writer and University College instructor, will discuss the experience of rewriting the new edition of Stroll: Psychogeographic Walking Tours of Toronto. We'll also hear about walking and exploring from Jacquline L. Scott, Glenn Sumi, and Sarah Luca.",
        "date": "November 28, 2024",
        "location": "Paul Cadario Conference Centre, University College, 15 King's College Circle, University of Toronto & Zoom"
      }
    },
    {
      "Name": "engSuccess Pop-Up: Wellness & Exams",
      "URL": "https://www.engineering.utoronto.ca/event/engsuccess-pop-up-wellness-exams/",
      "detailed_info": {
        "title": "engSuccess Pop-Up: Wellness & Exams",
        "description": "As exams approach, it’s essential to take care of your mental and physical well-being! Drop by our pop-up in Bahen Lobby to discover tips for managing stress, staying focused, and keeping your wellness in check during exam season. Upper-year mentors will be on hand to offer advice, and you can grab some refreshments to refuel.",
        "date": "November 28, 2024",
        "location": "Bahen Lobby, 40 St. George St, Toronto, ON, Canada"
      }
    },
    {
      "Name": "U of T Alumni Virtual Book Club - The Berry Pickers",
      "URL": "https://alumni.utoronto.ca/events/u-t-alumni-virtual-book-club-berry-pickers",
      "detailed_info": {
        "title": "U of T Alumni Virtual Book Club - The Berry Pickers",
        "description": "A virtual book club for U of T alumni. The session begins on October 11, 2024. Each session covers one book with weekly discussions. Join fellow alumni for lively discussion about books related to lifelong learning, social issues, psychology and more. Our next title is The Berry Pickers by Amanda Peters, a graduate of the University of Toronto's School of Continuing Studies.",
        "date": "Oct 11 - Dec 13, 2024",
        "location": "Online"
      }
    },
    {
      "Name": "Do Later-Life Healthcare Transitions Have to Be This Hard?",
      "URL": "https://alumni.utoronto.ca/events/do-later-life-healthcare-transitions-have-be-hard",
      "detailed_info": {
        "title": "Do Later-Life Healthcare Transitions Have to Be This Hard?",
        "description": "Proactive information, planning, and tips for the transition to elder-care for self, friends, and loved ones. The right information at the right time can help clear the fog of uncertainty and guide individuals and families through questions, conversations, and decisions.",
        "date": "Nov 19, 2024 - Jan 21, 2025",
        "location": "Online"
      }
    },
    {
      "Name": "Singapore: President’s Reception & Presentation",
      "URL": "https://alumni.utoronto.ca/events/singapore-presidents-reception-presentation-4",
      "detailed_info": {
        "title": "Singapore: President’s Reception & Presentation",
        "description": "Connect with esteemed U of T alumni and friends in Singapore. Join us for a compelling presentation by Dr. Christine Allen about how U of T’s Acceleration Consortium (AC) is addressing grand challenges for a sustainable future through its pioneering work with self-driving labs (SDLs).",
        "date": "Thu Nov 28, 2024",
        "location": "The Conrad Singapore Orchard 1 Cuscaden Road, Singapore"
      }
    },
    {
      "Name": "OISE Alumni and Friends Reception in Singapore",
      "URL": "https://alumni.utoronto.ca/events/oise-alumni-and-friends-reception-singapore",
      "detailed_info": {
        "title": "OISE Alumni and Friends Reception in Singapore",
        "description": "Join OISE Dean Erica Walker for a special gathering to connect, network, and celebrate our community during President Meric Gertler's Singapore visit.",
        "date": "Thu Nov 28, 2024",
        "location": "The Conrad Singapore Orchard 1 Cuscaden Road, The Cuscaden Room, Singapore"
      }
    },
    {
      "Name": "Your golden ticket to a fun PA Day",
      "URL": "https://alumni.utoronto.ca/events/alumni-family-event-charlie-and-the-chocolate-factory",
      "detailed_info": {
        "title": "Your golden ticket to a fun PA Day",
        "description": "Join us for a special production of 'Charlie and the Chocolate Factory' presented by Young People's Theatre for U of T Alumni and the kids in their lives. Family-friendly! Based on Roald Dahl’s beloved book, Young People's Theatre's production of 'Charlie and the Chocolate Factory' is a delicious adventure to Willy Wonka’s famous factory. Charlie, Grandpa Joe and the golden ticket-winners come to life in a dream world of chocolate rivers and gumdrop trees. Share the sweet magic with the kids in your life. Your $20.00 ticket includes: - Opportunities to participate in pre-show activities - Post-show Q&A with the cast and other key members of the show’s production team - Special take-home treat! Doors open at 12:00 PM Performance starts at 1:00 PM All activities will be hosted by YPT’s team of early childhood educators. This show is recommended to families with children ages 6+ (Gr 1+). Children of all ages are welcome!",
        "date": "Fri Nov 29, 2024",
        "location": "Young People's Theatre 165 Front St E, Toronto ON M5A 3Z4"
      }
    },
    {
      "Name": "Otherworld",
      "URL": "https://artmuseum.utoronto.ca/exhibition/otherworld/",
      "detailed_info": {
        "title": "Otherworld",
        "description": "_Otherworld_ is the first major solo museum exhibition by Camille Turner in Toronto. Born in Kingston, Jamaica, and currently living and working between Los Angeles and Costa Rica, Turner is widely recognized for her transformative examination of Black history in the Canadian national narrative. Working in performance, photography, installation, digital and sonic media, often in collaboration with others, Turner’s immersive exhibition continues her long-standing and wide-ranging exploration of Canada’s entanglement in the histories of the transatlantic trade of enslaved Africans. The newly commissioned exhibition _,__Otherworld_\n_,_ immerses the visitor in a non-linear Afro-Astronautic journey transcending space-time boundaries. Recognizing historical silences as both information and direction, Turner’s Afronautic research methodology takes the visitor deep into the archive, uncovering the traces and legacies of enslavement that extend from named enclaves of urban wealth in Toronto to the shipbuilding industry in Newfoundland. Filled with personal recollections and stories of immeasurable loss, the exhibition walks us back to the portals of departure and arrival of those forcibly taken from the shores of West Africa and dispersed throughout the Americas, and those lost in the passage between. Camille Turner’s work takes its inspiration from Afrofuturism; looping in and around time, it offers places of recovery and dreams of a liberated future. On their journey, the visitor is invited to listen to stories contained in the geologic time of displaced rocks and sea-worn sticks resembling bones, finding there the potential of changing history and, powered by the imagination, to make worlds otherwise.",
        "date": "September 4, 2024–March 22, 2025",
        "location": "Art Museum at the University of Toronto University of Toronto Art Centre (in University College) 15 King’s College Circle"
      }
    },
    {
      "Name": "Fall 2024 Nature Masterclass: Communicating to Non-Research Audiences – CRIS",
      "URL": "https://brn.utoronto.ca/event/fall-2024-nature-masterclass-communicating-to-non-research-audiences-cris/",
      "detailed_info": {
        "title": "Fall 2024 Nature Masterclass: Communicating to Non-Research Audiences – CRIS",
        "description": "The Centre for Research & Innovation Support (CRIS) has partnered with Nature Masterclasses to provide a no-cost, limited enrolment Masterclass focusing on communicating research to non-research audiences. It is becoming increasingly important for researchers to be able to clearly communicate their research to a broader audience, such as the public, the press, and even funding organizations. However, communicating complex specialized findings in an understandable and general manner is challenging for many researchers. This workshop provides attendees with practical strategies on how to achieve this goal. Participants will engage with numerous interactive elements and activities in the session and a provided workbook will be available for the attendees to download before the workshop to further guide and deepen participants’ learning. Ample Q&A time is allocated for participants to work with the expert facilitator.",
        "date": "Wednesday, December 04, 2024",
        "location": "9 King’s College Circle, Toronto, M7A 1A5"
      }
    },
    {
      "Name": "Statistical Sciences ARES: TBD",
      "URL": "https://canssiontario.utoronto.ca/event/ares-dec2/",
      "detailed_info": {
        "title": "NA",
        "description": "NA",
        "date": "NA",
        "location": "NA"
      }
    },
    {
      "Name": "STAGE ISSS: TBD",
      "URL": "https://canssiontario.utoronto.ca/event/isss-dec6/",
      "detailed_info": {
        "title": "STAGE ISSS: TBD",
        "description": "Join us for the next instalment of the STAGE International Speaker Seminar Series (ISSS) with Speaker Name: TBD. Free Hybrid (In-person/Online) Event | Registration Required.",
        "date": "Dec 06 2024",
        "location": "U of T - Rooms 10031 & 10032, 700 University Avenue, Toronto, ON"
      }
    },
    {
      "Name": "Statistical Sciences ARES: TBD",
      "URL": "https://canssiontario.utoronto.ca/event/ares-dec9/",
      "detailed_info": {
        "title": "NA",
        "description": "NA",
        "date": "NA",
        "location": "NA"
      }
    },
    {
      "Name": "End-of-Term Performances",
      "URL": "https://www.cdtps.utoronto.ca/events/2024end-of-term-performances",
      "detailed_info": {
        "title": "End-of-Term Performances",
        "description": "Join us at the Centre for Drama, Theatre & Performance Studies for our 2024 end-of-term performances starting on November 26 and running to November 28. Please check the schedule below as locations and times vary.",
        "date": "Tuesday, November 26, 2024 to Thursday, November 28, 2024",
        "location": "Helen Gardiner Phelan Playhouse, 79 St. George Street, Toronto, Ontario, M5S 2E5"
      }
    },
    {
      "Name": "Graduate Open House 2025",
      "URL": "https://www.cdtps.utoronto.ca/events/graduate-open-house-2025",
      "detailed_info": {
        "title": "Graduate Open House 2025",
        "description": "Are you interested in applying for graduate studies in drama, theatre, and performance studies at the University of Toronto? Attend our online Graduate Open House to find out about our curriculum, program requirements, funding opportunities and extracurricular activities; meet our faculty and staff; and tour our spaces virtually. This event will take place in Zoom meetings.",
        "date": "Wednesday, January 08, 2025 4:00 pm to 5:30 pm",
        "location": "Zoom meeting"
      }
    },
    {
      "Name": "Quiltro: A Staged Reading",
      "URL": "https://www.cdtps.utoronto.ca/events/quiltro-staged-reading",
      "detailed_info": {
        "title": "Quiltro: A Staged Reading",
        "description": "What would you do if you could experience the memories of your ancestors? Following her parents’ divorce, 13-year-old Nina runs away to join a group of stray dogs in her town. On her journey of self-actualization and acceptance, the looming, ominous presence of a dangerous cryptic creature stalks her, preying on the fear within her deep, dark memories.",
        "date": "Friday, January 31, 2025 7:00 pm to 9:00 pm",
        "location": "Playhouse Theatre Helen Gardiner Phelan Playhouse 79 St. George Street, Toronto, Ontario, M5S 2E5"
      }
    },
    {
      "Name": "National Day of Remembrance and Action of Violence against Women • (National)",
      "URL": "https://socialwork.utoronto.ca/event/national-day-of-remembrance-and-action-of-violence-against-women-national/",
      "detailed_info": {
        "title": "National Day of Remembrance and Action of Violence against Women",
        "description": "We wish to acknowledge this land on which the University of Toronto operates. For thousands of years it has been the traditional land of the Huron-Wendat, the Seneca, and the Mississaugas of the Credit. Today, this meeting place is still the home to many Indigenous people from across Turtle Island and we are grateful to have the opportunity to work on this land.",
        "date": "December 6",
        "location": "246 Bloor Street W, Toronto, Ontario M5S 1V4"
      }
    },
    {
      "Name": "Yalda • Zoroastrian",
      "URL": "https://socialwork.utoronto.ca/event/yalda-zoroastrian/",
      "detailed_info": {
        "title": "Yalda • Zoroastrian",
        "description": "A celebration of the winter solstice, gradual lengthening of day and good over evil. Common greetings: “Shabe Yalda Mobarak” or “Happy Yalda”",
        "date": "December 21",
        "location": "NA"
      }
    },
    {
      "Name": "Yule • Wiccan/Pagan",
      "URL": "https://socialwork.utoronto.ca/event/yule-wiccan-pagan/",
      "detailed_info": {
        "title": "Yule • Wiccan/Pagan",
        "description": "The winter festival during which people can give thanks for the past and welcome the future. Common greetings: “Happy Yule” or “Blessed Yule”",
        "date": "December 21",
        "location": "NA"
      }
    },
    {
      "Name": "Human Light Day • Humanist",
      "URL": "https://socialwork.utoronto.ca/event/human-light-day-humanist/",
      "detailed_info": {
        "title": "Human Light Day • Humanist",
        "description": "HumanLight is a Humanist holiday celebrated annually on December 23. HumanLight was first celebrated in 2001, and was created to provide a specifically Humanist celebration during the western world’s holiday season.",
        "date": "December 23",
        "location": "NA"
      }
    },
    {
      "Name": "Christmas • Christian",
      "URL": "https://socialwork.utoronto.ca/event/christmas-christian/",
      "detailed_info": {
        "title": "Christmas • Christian",
        "description": "A religious and cultural holiday. Christians celebrate Christmas Day as the birthday of Jesus with gift-giving and other festivities. Common greetings: “Merry Christmas”",
        "date": "December 25",
        "location": "NA"
      }
    },
    {
      "Name": "engSuccess Pop-Up: Wellness & Exams",
      "URL": "https://www.engineering.utoronto.ca/event/engsuccess-pop-up-wellness-exams/",
      "detailed_info": {
        "title": "engSuccess Pop-Up: Wellness & Exams",
        "description": "As exams approach, it’s essential to take care of your mental and physical well-being! Drop by our pop-up in Bahen Lobby to discover tips for managing stress, staying focused, and keeping your wellness in check during exam season. Upper-year mentors will be on hand to offer advice, and you can grab some refreshments to refuel.",
        "date": "November 28, 2024",
        "location": "Bahen Lobby, 40 St. George St, Toronto, ON, Canada"
      }
    },
    {
      "Name": "Guided Engineering Academic Review Session (GEARS) Year 1 – 2024 Fall Term",
      "URL": "https://www.engineering.utoronto.ca/event/guided-engineering-academic-review-session-gears-year-1-2024-fall-term-12/",
      "detailed_info": {
        "title": "Guided Engineering Academic Review Session (GEARS) Year 1 – 2024 Fall Term",
        "description": "GEARS is a great opportunity to connect with upper year EngScis who can answer questions related to your courses, the Engineering Science program and opportunities within Engineering and the University. GEARS Mentors represent different Majors, clubs & societies – some have completed PEY or done summer research at U of T or abroad. The sessions are drop-in, so arrive when you can and stay for as long as you’d like.",
        "date": "Thu November 28, 2024",
        "location": "Current EngSci students, log in to the EngSci Info Hub here for location and details."
      }
    },
    {
      "Name": "ROM After Dark – young alumni event (sold out)",
      "URL": "https://www.engineering.utoronto.ca/event/rom-after-dark-young-alumni-event/",
      "detailed_info": {
        "title": "ROM After Dark – young alumni event (sold out)",
        "description": "Join us for an exclusive young alumni meet-up at ROM After Dark! Reconnect with fellow engineering grads for an unforgettable evening of art, culture and entertainment at the Royal Ontario Museum’s vibrant after-hours event. We’ve arranged special discounted tickets just for you—don’t miss this opportunity to experience one of the city’s most unique art events while catching up with your U of T Engineering friends! Earth: An Immersive Journey – November’s theme invites you to explore a world where art, technology and nature collide. From pulsating dance floors to serene sound baths, this event promises to be an unforgettable night. Each ticket gets you access to the entire Museum, including the fan-favourite exhibition, Earth: An Immersive Journey. Your ticket includes one drink and one swag item. Food and beverage will be available for purchase. 19+ event. Visitors will be asked for valid photo government ID upon arrival.",
        "date": "Fri November 29, 2024",
        "location": "Royal Ontario Museum, 100 Queens Park, Toronto, Ontario, M5S 2C6, Canada"
      }
    },
    {
      "Name": "U of T Big Data & Artificial Intelligence Competition Registration Deadline",
      "URL": "https://www.engineering.utoronto.ca/event/u-of-t-big-data-artificial-intelligence-competition-registration-deadline/",
      "detailed_info": {
        "title": "U of T Big Data & Artificial Intelligence Competition Registration Deadline",
        "description": "All U of T students with big data/AI experience are welcome to compete in the 2024-2025 IMI BIGDataAIHUB Big Data and Artificial Intelligence Competition! This competition is designed as a developmental opportunity for students to gain hands-on exposure to big data and artificial intelligence through real-world data – with the chance to win $30,000 in cash prizes. Entry is free and open to all U of T students. Please note that the competition is geared toward students with advanced programming and AI skills.",
        "date": "Fri November 29, 2024",
        "location": "Online"
      }
    },
    {
      "Name": "Build Your Exam Plan Workshop",
      "URL": "https://www.engineering.utoronto.ca/event/build-your-exam-plan-workshop-2/",
      "detailed_info": {
        "title": "Build Your Exam Plan Workshop",
        "description": "Ready to conquer exam season? Join our Build Your Exam Plan Workshop and discover how to craft a personalized study plan that works for you! Learn strategies to prioritize your test content, optimize your study time, and say goodbye to last-minute cramming!",
        "date": "Mon December 2, 2024",
        "location": "Galbraith Building Room 202 (GB202)"
      }
    },
    {
      "Name": "History of Philosophy Research Group Talk (Thierry Côté, Toronto)",
      "URL": "https://philosophy.utoronto.ca/event/history-philosophy-group-talk-thierry-cote-toronto/",
      "detailed_info": {
        "title": "History of Philosophy Research Group Talk (Thierry Côté, Toronto)",
        "description": "The History of Modern Philosophy Group is pleased to welcome as its guest speaker Thierry Côté, a postdoctoral fellow in the Department of Philosophy at the University of Toronto. Dr. Côté specializes in early modern philosophy and aesthetics, with additional interests in the philosophy of music, the philosophy of literature, and contemporary French philosophy. He earned his PhD from the Université de Montréal in 2023, with a dissertation titled “Musique, parole et signification au siècle des Lumières.”",
        "date": "Friday November 29, 2024, 11:00 am - 1:00 pm",
        "location": "Jackman Humanities Building, Room 100 (Main Floor Lecture Hall), 170 St. George Street, Toronto, Ontario, M5R 2M8, Canada"
      }
    },
    {
      "Name": "Book Talk- A World More Equal : An Internationalist Perspective on the Cold War",
      "URL": "https://munkschool.utoronto.ca/event/book-talk-world-more-equal-internationalist-perspective-cold-war",
      "detailed_info": {
        "title": "Book Talk- A World More Equal : An Internationalist Perspective on the Cold War",
        "description": "The post–World War II period is typically seen as a time of stark division, an epochal global conflict between the United States and the Soviet Union. But beneath the surface, the postwar era witnessed a striking degree of international cooperation. The United Nations and its agencies, as well as regional organizations, international nongovernmental organizations, and private foundations brought together actors from conflicting worlds, fostering international collaboration across the geopolitical and ideological divisions of the Cold War. Diving into the archives of these organizations and associations, Sandrine Kott provides a new account of the Cold War that foregrounds the rise of internationalism as both an ideology and a practice. She examines cooperation across boundaries in international spaces, emphasizing the role of midsized powers, including Eastern European and neutral countries. Kott highlights how the need to address global inequities became a central concern, as officials and experts argued that economic inequality imperiled the creation of a lasting peace. International organizations gave newly decolonized and “Third World” countries a platform to challenge the global distribution of power and wealth, and they encouraged transnational cooperation in causes such as human rights and women’s rights. Assessing the failure to achieve a new international economic order in the 1970s, Kott adds new perspective on the rise of neoliberalism. A truly global study of the Cold War through the lens of international organizations, A World More Equal also shows why the internationalism of this era offers resources for addressing social and global inequalities today.",
        "date": "November 29, 2024",
        "location": "Room 108, North House, 1 Devonshire Place, Toronto, ON, M5S 3K7"
      }
    },
    {
      "Name": "Book Talk- Flexible Authoritarianism: Cultivating Ambition and Loyalty in Russia",
      "URL": "https://munkschool.utoronto.ca/event/book-talk-flexible-authoritarianism-cultivating-ambition-and-loyalty-russia",
      "detailed_info": {
        "title": "Book Talk- Flexible Authoritarianism: Cultivating Ambition and Loyalty in Russia",
        "description": "Flexible Authoritarianism challenges the notion that authoritarianism's transnational rise constitutes a backlash against economic globalization. Describing a governmental approach that simultaneously incentivizes a can-do spirit and suppresses dissent, the book points out resonances between authoritarian and neoliberal ideologies in today's comeback of strongman rule. Drawing on field observations, in-depth interviews, and analyses of video clips, it conveys the look and feel of flexible authoritarianism in Russia through the eyes of up-and-coming youth. The author analyzes ways in which the insignia of cool start-up capitalism and familiar cultural forms such as the summer camp help stabilize the regime, while also showing how up-and-coming youth both embrace and contest loyalty to the government.",
        "date": "December 2, 2024",
        "location": "Room 108, North House, 1 Devonshire Place, Toronto, ON, M5S 3K7"
      }
    },
    {
      "Name": "The Long Road to Freedom: Ukrainian POWs’ Repatriation from Germany and Austria (1918-1920)",
      "URL": "https://munkschool.utoronto.ca/event/long-road-freedom-ukrainian-pows-repatriation-germany-and-austria-1918-1920",
      "detailed_info": {
        "title": "The Long Road to Freedom: Ukrainian POWs’ Repatriation from Germany and Austria (1918-1920)",
        "description": "The presentation will examine the understudied topic of Ukrainian POWs from the Imperial Russian army detained in Central Powers camps and their repatriation, which occurred at a pivotal moment of geopolitical shifts and national revival, both in Ukraine and in the camps. After the Treaty of Brest-Litovsk, efforts of the Union for the Liberation of Ukraine led to the formation of the Blue- and Grey-Coated divisions from a few hundred patriotic Ukrainian POWs. For around 40,000 Ukrainian POWs, imprisonment continued well beyond post-war settlements due to the enduring violence in Central and Eastern Europe and the communist threat. Ukrainian repatriation missions, hindered by diplomatic and financial obstacles, faced difficulties in securing evacuation routes. Drawing on primary sources from Library and Archives Canada and archives in Ukraine, Germany, Austria, and Poland, this presentation will reveal the complex efforts, hardships, and shifting allegiances that shaped Ukrainian POWs’ repatriation, providing insights into the broader struggles for freedom and identity in early 20th-century Europe.",
        "date": "December 3, 2024",
        "location": "Room 108, North House, 1 Devonshire Place, Toronto, ON, M5S 3K7"
      }
    },
    {
      "Name": "Knowledge Café: Cities and Spatial Inequality",
      "URL": "https://munkschool.utoronto.ca/event/knowledge-cafe-cities-and-spatial-inequality",
      "detailed_info": {
        "title": "Knowledge Café: Cities and Spatial Inequality",
        "description": "Sometime around 1980, in the United States as well as in a range of other high-income countries, a new economic geography began to emerge. Under this new pattern, rewards have been lavished upon highly educated workers living in a group of increasingly large, prosperous cities. At the same time, gaps in welfare and opportunity separating these ‘superstar’ cities from the rest of the urban system have grown. This has created the impression of a deep polarization between winners and ‘left behind’ places. Despite growing attention from academic researchers, policymakers, and practitioners, the reality of 21st century urbanization remains insufficiently well understood. In this talk, Dr. Tom Kemeny will outline the problem across multiple dimensions, including incomes, social mobility, wealth, and housing. He argues for an explanation centered on two major forces: epochal technological innovation, and fundamental changes in land supply. This account contrasts with a dominant, supply-side narrative about location and equality, in which changes in zoning rules can enable prosperity for all. Instead, the view he will articulate points to a future of persistent polarization in the American system.",
        "date": "December 4, 2024",
        "location": "Online via Zoom"
      }
    },
    {
      "Name": "MPA/MGA Dual Degree with LSE, in London and UofT, Munk School (MGA) in Toronto Admissions Info-session",
      "URL": "https://munkschool.utoronto.ca/event/mpamga-dual-degree-lse-london-and-uoft-munk-school-mga-toronto-admissions-info-session",
      "detailed_info": {
        "title": "MPA/MGA Dual Degree with LSE, in London and UofT, Munk School (MGA) in Toronto Admissions Info-session",
        "description": "Prospective students interested in our MPA Double Degree Program with the University of Toronto are invited to meet Professor Vanessa Rubio-Marquez, Program Director, and Rejeanne Puran, Recruitment and Admissions Officer at the Munk School, to learn more about this unique dual-degree opportunity.",
        "date": "December 4, 2024",
        "location": "Online"
      }
    },
    {
      "Name": "NewOne Knowledge Fair - Fall 2024",
      "URL": "https://www.newcollege.utoronto.ca/event/fall-2024-knowledge-fair/",
      "detailed_info": {
        "title": "NewOne Knowledge Fair – Fall 2024",
        "description": "Join us for NewOne's final showcase of student projects at the Knowledge Fair on November 28. This year, students explored environmental issues, took apart technologies and studied their uses and misuses, grappled with the politics of data science, engaged with land-based knowledge, dealt with difficult conversations such as gun violence, war, climate disasters and so much more. Celebrate their research projects at this term's Knowledge Fair!",
        "date": "11/28/2024",
        "location": "William Doo Auditorium, New College at 45 Willcocks Street"
      }
    },
    {
      "Name": "Book Launch & Panel Discussion - \"This Wasn't on the Syllabus\"",
      "URL": "https://www.newcollege.utoronto.ca/event/book-launch-panel-discussion-this-wasnt-on-the-syllabus/",
      "detailed_info": {
        "title": "Book Launch & Panel Discussion – “This Wasn’t on the Syllabus”",
        "description": "Official book launch for \"This Wasn’t on the Syllabus: Stories from the Front Lines of Campus Activism Against Sexualized Violence”! About the Book: THIS WASN'T ON THE SYLLABUS illuminates the courageous stories of campus activism against sexualized violence in Canada, uniting over three decades of personal accounts and resistance in a powerful call to prioritize and amplify the voices of student activists worldwide. This book is both a record and an act of protest, progress, and survival within Canada’s post-secondary landscape. The collection features personal accounts which articulate not only the prevalence of sexualized violence on campus, but how these acts inspire students to activism. The book is a call to value and prioritize the voices of student activists, who are often among those most impacted by sexualized violence, and who are key participants in driving change. BOOKS WILL BE AVAILABLE FOR PURCHASE AT THIS EVENT FROM ANOTHER STORY BOOKSHOP. THIS IS A FREE EVENT OPEN TO THE PUBLIC. Registration is required. Space is limited!",
        "date": "12/04/2024",
        "location": "20 Willcocks Street, Toronto ON M5S 1C6"
      }
    },
    {
      "Name": "Get Crafty with Us @ Hart House",
      "URL": "https://www.oise.utoronto.ca/registrar-students/events/11-28-24-get-crafty-us-hart-house",
      "detailed_info": {
        "title": "Get Crafty with Us @ Hart House",
        "description": "The fall term is about to end, join us this Thursday for a relaxing crafting session! We will be meeting in front of OISE at 10:40 am to make our way to Hart House for 11 am. To attend with AcSoC please sign-up with the Google Formlink is external! All materials will be provided, this event is drop-in.",
        "date": "Nov 28, 2024 | 11:00am - 1:00pm",
        "location": "Hart House | University of Toronto, 7 Hart House Circle, Toronto ON M5S 3H3 Canada"
      }
    },
    {
      "Name": "Crafting Connections: Needle Felting",
      "URL": "https://www.oise.utoronto.ca/gsa/events/11-28-24-crafting-connections-needle-felting",
      "detailed_info": {
        "title": "Crafting Connections: Needle Felting",
        "description": "Discover the art of needle felting with barbed needles and colorful fibers! Materials will be provided, and no prior experience is necessary—just bring your enthusiasm and creativity. Join us for a fun, hands-on workshop as part of our Crafting Connections series! Needle felting is an accessible fiber art that uses wool and barbed needles to create beautiful felted sculptures and designs. Whether you’re an experienced crafter or a complete beginner, this session will offer a unique experience for everyone. Guided by our facilitators, you’ll learn the basics of needle felting and create your own one-of-a-kind piece. Enjoy crafting, light refreshments, and the opportunity to connect with fellow students in a creative, interactive, and supportive community environment.",
        "date": "November 28, 2024",
        "location": "OISE GSA Lounge (8-109)"
      }
    },
    {
      "Name": "Where is K-12 public education going?",
      "URL": "https://empowrconnect.substack.com/p/laurier-hxa-event-where-is-k-12-public",
      "detailed_info": {
        "title": "Laurier HxA EVENT: Where is K-12 public education going?",
        "description": "Three experts, three points of view. An evening for parents, educators, and the public. The trajectory of the Ontario public school system is hotly contested. While the Ministry of Education, Faculties of Education, and Boards of Education increasingly prioritize social justice, many parents are concerned about basic education. For example, the Ontario Human Rights Commission found that our schools are failing to teach children to read! Many parents perceive a lack of access to education experts. Others feel that these experts are unwilling to persuade them of the benefits of new approaches. To address these perceptions, LaurierHxA has arranged for three education experts, each with different views, to discuss the direction of K-12 education.",
        "date": "Thursday, November 28th, 7:00 PM",
        "location": "Bricker Academic Building, Room BA101, Wilfrid Laurier University, Waterloo"
      }
    },
    {
      "Name": "Mobilizing (Black) Queer & Trans Ways of Knowing",
      "URL": "https://www.oise.utoronto.ca/cbse/events/12-03-24-mobilizing-black-queer-trans-ways-knowing",
      "detailed_info": {
        "title": "Mobilizing (Black) Queer & Trans Ways of Knowing",
        "description": "Led by Professor Qui Alexander, this session will explore how students can engage in research that goes beyond using queer & trans people as subjects and think about what it means to put (Black) queer & trans ways of knowing to work.",
        "date": "Dec 3, 2024 | 5:00 - 6:30pm",
        "location": "CBSE - Room 225, 2nd Floor 252 Bloor Street West Toronto ON M5S 1V6 Canada"
      }
    },
    {
      "Name": "Rise & Realign",
      "URL": "https://www.oise.utoronto.ca/wellness/events/09-25-24-rise-realign",
      "detailed_info": {
        "title": "Rise & Realign",
        "description": "Awaken and realign the body and mind with a grounding meditation, nourishing breath practice, and supportive movement. Ease any stress or strain, maintain energy, enhance wellbeing, and perhaps feel a sense of wholeness.",
        "date": "Dec 4, 2024 | 11:30am - 12:00pm",
        "location": "OISE 252 Bloor St. West Room 12-115 Toronto ON M5S1V6 Canada"
      }
    },
    {
      "Name": "Spring 2025 Convocation Dates",
      "URL": "https://governingcouncil.utoronto.ca/convocation/event-meeting/spring-2025-convocation-dates",
      "detailed_info": {
        "title": "Spring 2025 Convocation Dates",
        "description": "Spring Convocation ceremonies are scheduled to run from June 3-20, 2025. The full schedule will be posted here as soon as it is available. The Office of Convocation will begin sending information to potential graduates, including details regarding gown rental and ticket ordering, for the Spring 2025 Convocation in late March/early April (late April for School of Graduate Studies students).",
        "date": "Tue, Jun 3 2025 at 10:00 am - Fri, Jun 20 2025 at 4:00 pm",
        "location": "NA"
      }
    },
    {
      "Name": "Fall 2025 Convocation Dates",
      "URL": "https://governingcouncil.utoronto.ca/convocation/event-meeting/fall-2025-convocation-dates",
      "detailed_info": {
        "title": "Fall 2025 Convocation Dates",
        "description": "Fall Convocation ceremonies are scheduled to run from October 27-31, 2025. The full schedule will be posted here as soon as it is available. The Office of Convocation will begin sending information to potential graduates, including details regarding gown rental and ticket ordering, for the Fall 2025 Convocation in mid-to-late September (late September for School of Graduate Studies students).",
        "date": "Mon, Oct 27 2025 at 10:00 am - Fri, Oct 31 2025 at 4:00 pm",
        "location": "NA"
      }
    },
    {
      "Name": "Pilates",
      "URL": "https://stmikes.utoronto.ca/event/pilates/2024-11-28",
      "detailed_info": {
        "title": "Pilates",
        "description": "Join instructor Gillian for a fun and challenging, full-body workout incorporating high intensity interval training methods with Pilates principles. Beginner friendly. Mats, weights, and change room provided. Please arrive at 4pm to settle in. Class will begin by 4:10pm.",
        "date": "November 28 @ 4:00 pm – 5:00 pm EST",
        "location": "SMC Wellness Studio (81 St. Mary Street), 81 St. Mary Street, Toronto, Ontario M5S 1J4"
      }
    },
    {
      "Name": "Budo-taijutsu",
      "URL": "https://stmikes.utoronto.ca/event/budo-taijutsu-188/2024-11-28",
      "detailed_info": {
        "title": "Budo-taijutsu",
        "description": "Budo-taijutsu focuses mainly on self-defense and on the defense of others, using realistic training methods. Through training in the Bujinkan system, students can learn personal security, discipline and a code of lifelong values that could be easily utilized in the university setting. SMC Wellness Studio can be found at the ground floor of Elmsley Hall (81 St. Mary Street) facing the Coop Patio. No pre-registration required.",
        "date": "November 28 @ 6:00 pm – 9:00 pm EST",
        "location": "SMC Wellness Studio (81 St. Mary Street), 81 St. Mary Street, Toronto, Ontario, M5S 1J4"
      }
    },
    {
      "Name": "Relaxation Zone",
      "URL": "https://stmikes.utoronto.ca/event/relaxation-zone-2/2024-11-28",
      "detailed_info": {
        "title": "Relaxation Zone",
        "description": "The St. Mike’s Wellness Studio transforms weekly into a carefully curated oasis of calm and space for self-care. On Thursday afternoons, spend an hour dedicated to relaxation and mindfulness practice in the Wellness Studio (featuring meditation, mindful games, gentle stretching, journaling, sensory materials, sound bathing, puzzles, and more)! All supplies provided- drop-ins welcome (no pre-registration required). The St. Mike’s Wellness Studio is located on the ground floor of Elmsley Hall (81 St. Mary Street). Access the main door across from the COOP Patio.",
        "date": "November 28 @ 3:00 pm – 4:00 pm EST",
        "location": "SMC Wellness Studio (81 St. Mary Street), 81 St. Mary Street, Toronto, Ontario, M5S 1J4"
      }
    },
    {
      "Name": "Kudoki Kung Fu",
      "URL": "https://stmikes.utoronto.ca/event/kudoki-kung-fu-25/2024-11-29",
      "detailed_info": {
        "title": "Kudoki Kung Fu",
        "description": "Kudoki kung fu teaches traditional forms (kata), a variety of sparring and grappling techniques, and integrates self-defense into classes. The focus is on traditional and contemporary martial arts, emphasizing mind, body, and spirit integration. SMC Wellness Studio can be found at the ground floor of Elmsley facing the Coop Patio.",
        "date": "November 29 @ 2:00 pm – 3:00 pm EST",
        "location": "SMC Wellness Studio (81 St. Mary Street), 81 St. Mary Street, Toronto, Ontario, M5S 1J4"
      }
    },
    {
      "Name": "Budo-taijutsu",
      "URL": "https://stmikes.utoronto.ca/event/budo-taijutsu-187/2024-11-29",
      "detailed_info": {
        "title": "Budo-taijutsu",
        "description": "Budo-taijutsu focuses mainly on self-defense and on the defense of others, using realistic training methods. Through training in the Bujinkan system, students can learn personal security, discipline, and a code of lifelong values that could be easily utilized in the university setting. SMC Wellness Studio can be found at the ground floor of Elmsley facing the Coop Patio. No pre-registration required.",
        "date": "November 29 @ 12:00 pm – 1:00 pm EST",
        "location": "SMC Wellness Studio (81 St. Mary Street), 81 St. Mary Street, Toronto, Ontario, M5S 1J4"
      }
    },
    {
      "Name": "Sustainable Fashion Series Part 1: Clothing Swap and DIY Tote Bag Workshop",
      "URL": "https://www.environment.utoronto.ca/events/sustainable-fashion-series-part-1-clothing-swap-and-diy-tote-bag-workshop",
      "detailed_info": {
        "title": "Sustainable Fashion Series Part 1: Clothing Swap and DIY Tote Bag Workshop",
        "description": "The School of the Environment and the Environmental Students' Union (ENSU) invite you to attend Part 1 of our Sustainable Fashion Series. At the Clothing Swap and DIY Tote Bag Workshop attendees are invited to decorate their own tote bag and bring their clothes to swap with other attendees at the event. Please note that materials for the DIY Tote Bag Workshop will be provided to all attendees. Supplies are limited and will be distributed on a first come first served basis. The event will be held on Wednesday, December 4th, 2024, from 4:00 pm - 6:00 pm in ES 1042 (5 Bancroft Avenue). Attendees interested in participating in the clothing swap are encouraged to drop off their clothes at the School of the Environment's administrative offices at ES1016V (33 Willcocks Street) on Friday, November 29th from 11:00 am - 3:00 pm. Attendees can also bring their clothes to swap the day of the event. Please limit number of drop-off items to 10 per person. Please note: All items must be in decent condition and washed. No stains, holes, etc.",
        "date": "Wednesday, December 04, 2024",
        "location": "ES 1042 Earth Sciences Centre, 5 Bancroft Avenue, Toronto, ON M5S 3J1"
      }
    },
    {
      "Name": "Environment Seminar Series: When history is catching up with us - risk analysis and decision-making for...",
      "URL": "https://www.environment.utoronto.ca/events/environment-seminar-series-when-history-catching-us-risk-analysis-and-decision-making-risk",
      "detailed_info": {
        "title": "Environment Seminar Series: When history is catching up with us - risk analysis and decision-making for the risk management of historic ship wrecks with Roxana Suehring",
        "description": "Ship wrecks are fascinating. They have inspired stories of heroes, monsters, and the perils of the sea for centuries. They inspire artists, treasure hunters, and a substantial tourism industry for wreck diving. Yet, there s a part of their story we dont usually hear about: the potential for environmental pollution. In 2017 the UK Ministry of Defence tasked an interdisciplinary group of historians, oceanographers, chemists, and ecologists to investigate and prioritize the risk of oil pollution from ships that had been sunk in the North Sea during the first and second world war. A fascinating and challenging task, since there was no method, guideline, or even previously published research on how to do what they were asking for. In this seminar, I would like to discuss the approaches, questions, challenges, and - quite frankly - fun we had figuring out how to make decisions about 100 year old ships at the bottom of the ocean.",
        "date": "Friday, February 07, 2025 12:00 pm to 2:00 pm",
        "location": "NA"
      }
    },
    {
      "Name": "Climate Health and Sustainable Care Student Training Program",
      "URL": "https://temertymedicine.utoronto.ca/event/climate-health-and-sustainable-care-student-training-program-0",
      "detailed_info": {
        "title": "Climate Health and Sustainable Care Student Training Program",
        "description": "Apply Now! Climate Health and Sustainable Care Student Training Program APPLICATION DEADLINE JULY 15th! One year, non-credit certificate program Open to University of Toronto Students For graduate, 2nd entry professional and professional students Research-oriented training for students Estimated Learner Effort: approx. 6 hours a month Students receive $1500 stipend",
        "date": "Sep 18, 2024 - Aug 31, 2025",
        "location": "155 College Street, Toronto, Ontario, Canada, M5T 3M6"
      }
    },
    {
      "Name": "Advanced Clinician Practitioner in Arthritis Care (ACPAC) Program",
      "URL": "https://temertymedicine.utoronto.ca/event/advanced-clinician-practitioner-arthritis-care-acpac-program",
      "detailed_info": {
        "title": "Advanced Clinician Practitioner in Arthritis Care (ACPAC) Program",
        "description": "Lead the transformation of arthritis and musculoskeletal care and take the next step in your career. The award-winning Advanced Clinician Practitioner in Arthritis Care (ACPAC) Program prepares experienced physiotherapists, occupational therapists, nurses, and chiropractors for extended practice roles in a variety of clinical settings. Application deadline is May 31 annually for the program starting in September. This competency-based program integrates academic and clinical training over the course of 5 intensive, week-long sessions (2 weeks of hand-on learning on-site in Toronto and 3 weeks of online learning). The comprehensive curriculum focuses on the assessment, diagnosis, triage, and independent management of arthritis and musculoskeletal conditions in both adult and paediatric populations. Completion of the ACPAC program recognizes your advanced, post-licensure training in arthritis and musculoskeletal care. Our graduates are employed in orthopaedics and rheumatology outpatient clinics, hospitals, chronic pain programs, and rapid access clinics.",
        "date": "Sep 23, 2024 - May 30, 2025",
        "location": "Toronto, ON"
      }
    },
    {
      "Name": "CPD Foundations (online certificate program)",
      "URL": "https://temertymedicine.utoronto.ca/event/cpd-foundations-online-certificate-program",
      "detailed_info": {
        "title": "CPD Foundations (online certificate program)",
        "description": "Create transformative CPD for health professionals. Focusing on the fundamental theory and skills necessary to build successful CPD, explore practical issues commonly experienced in CPD design, development, and implementation in CPD Foundations. Across 12 experiential modules, you'll explore what goes into implementing effective CPD from planning models and program design to evaluation and accreditation. Save on the program fee when you register by August 26, 2024.",
        "date": "October 15, 2024 - June 3, 2025",
        "location": "Temerty Faculty of Medicine, Dean's Office 1 King's College Circle, Medical Sciences Building, Room 2109 Toronto, ON. M5S 1A8"
      }
    },
    {
      "Name": "TGD Gathering: Workshop & Social",
      "URL": "https://temertymedicine.utoronto.ca/event/tgd-gathering-workshop-social",
      "detailed_info": {
        "title": "TGD Gathering: Workshop & Social",
        "description": "The Office of Inclusion & Diversity invites all learners (from graduate, professional, and medical streams), staff, and faculty members at Temerty Medicine Faculty of Medicine (TFoM) who identify as part of the transgender and gender diverse (TGD) community for our upcoming TGD gathering workshop and social event with speaker Scout Swartz from U of T’s Sexual & Gender Diversity Office (SGDO). Clinicians or healthcare workers at any of the Toronto Academic Health Sciences Network (TAHSN) hospital sites who identify in these ways are also invited and encouraged to attend. Scout (they/them), a Program Coordinator with the SGDO, will attend the event to give an overview of the office and share information about programs, events, trainings, supports, and resources available for 2SLGBTQ+ students, staff, faculty, and librarians. Scout will discuss opportunities for folks to support 2SLGBTQ+ communities on campus and beyond. Light refreshments will be served.",
        "date": "Jun 20, 2024 | 4:00pm - 7:00pm",
        "location": "Temerty Faculty of Medicine, Dean's Office 1 King's College Circle, Medical Sciences Building, Room 2109 Toronto, ON. M5S 1A8"
      }
    },
    {
      "Name": "Trinity College Holiday Skate Night",
      "URL": "https://www.trinity.utoronto.ca/events/holidayskate2024/",
      "detailed_info": {
        "title": "Trinity College Holiday Skate Night",
        "description": "Join us for a Trinity College Holiday Skate Night at the Varsity Rink. This event is open to all Trinity Alumni. Families with children are also encouraged to attend! We will also have adult-sized skates and helmets available to rent. Families will be required to bring child-sized skates and helmets for their children. Please note children under 12 and beginners under 17 must be accompanied by an adult, and adults can supervise a maximum of 2 children. Skates and helmets will be available for rent on a first-come, first-served basis. We look forward to skating with you! Please get in touch with alumni@trinity.utoronto.ca if you have any questions.",
        "date": "Tuesday, December 3, 2024",
        "location": "Varsity Arena"
      }
    },
    {
      "Name": "U of T | International Day of Persons with Disabilities 2024",
      "URL": "https://people.utoronto.ca/inclusion/dates-of-observance/?query=international-day-of-persons-with-disabilities",
      "detailed_info": {
        "title": "International Day of Commemoration in Memory of the Victims of the Holocaust",
        "description": "Created in 2005 by the United Nations General Assembly, the International Day of Commemoration in Memory of the Victims of the Holocaust encourages remembrance, reflection, and education about the causes and consequences of the Holocaust. The Holocaust claimed the lives of more than six million Jewish men, women, and children as well as members of other persecuted populations, including members of Romani communities, LGBTQ+ individuals, persons with disabilities, and political dissidents. The date January 27 commemorates January 27, 1945, when the largest of the Nazi Concentration Camps, Auschwitz-Birkenau, was liberated. This act forced citizens worldwide to confront the horrific results of unchecked hatred and discrimination—and of their own complicity through collective inaction.",
        "date": "January 27",
        "location": "NA"
      }
    },
    {
      "Name": "U of T | National Day of Remembrance and Action on Violence Against Women",
      "URL": "https://people.utoronto.ca/inclusion/dates-of-observance/?query=national-day-of-remembrance-and-action-on-violence-against-women",
      "detailed_info": {
        "title": "International Day of Commemoration in Memory of the Victims of the Holocaust",
        "description": "Created in 2005 by the United Nations General Assembly, the International Day of Commemoration in Memory of the Victims of the Holocaust encourages remembrance, reflection, and education about the causes and consequences of the Holocaust. The Holocaust claimed the lives of more than six million Jewish men, women, and children as well as members of other persecuted populations, including members of Romani communities, LGBTQ+ individuals, persons with disabilities, and political dissidents. The date January 27 commemorates January 27, 1945, when the largest of the Nazi Concentration Camps, Auschwitz-Birkenau, was liberated. This act forced citizens worldwide to confront the horrific results of unchecked hatred and discrimination—and of their own complicity through collective inaction.",
        "date": "January 27",
        "location": "NA"
      }
    },
    {
      "Name": "Faculty of Divinity: Kierkegaard Circle – Not Telling Everything",
      "URL": "http://sites.utoronto.ca/kierkegaard/upcoming.htm",
      "detailed_info": {
        "title": "Upcoming Session - Kierkegaard Circle",
        "description": "Not Telling Everything: Kierkegaard’s Indirect Communication and Chan Buddhism’s _bu shuo po_",
        "date": "Friday, December 6, 2024 5:00 pm –7:00 pm (Toronto time) EDT",
        "location": "Combination Room Trinity College University of Toronto"
      }
    },
    {
      "Name": "Advent Lessons and Carols",
      "URL": "https://www.trinity.utoronto.ca/events/advent-lessons-and-carols/",
      "detailed_info": {
        "title": "Advent Lessons and Carols",
        "description": "Join us as we celebrate the start of the holiday season! Please join us for the traditional service of Advent Lessons and Carols in the Trinity College Chapel. The Rev’d Canon Andrea Budgey, Humphrys Chaplain, will officiate, joined by readers from the college community. Unfortunately, due to unforeseen circumstances, this year’s event will not be livestreamed. After the service, attendees are invited to a drop-in social in the Divinity Common Room. Please register as space is limited.",
        "date": "Sunday, December 8, 2024",
        "location": "Trinity College Chapel"
      }
    },
    {
      "Name": "Strollin'",
      "URL": "https://www.uc.utoronto.ca/events/strollin",
      "detailed_info": {
        "title": "Strollin'",
        "description": "Join us for an evening talking about walking. Shawn Micallef, writer and University College instructor, will discuss the experience of rewriting the new edition of Stroll: Psychogeographic Walking Tours of Toronto. We'll also hear about walking and exploring from Jacquline L. Scott, Glenn Sumi, and Sarah Luca.",
        "date": "November 28, 2024",
        "location": "Paul Cadario Conference Centre, University College, 15 King's College Circle, University of Toronto & Zoom"
      }
    },
    {
      "Name": "I, Joan",
      "URL": "https://www.utm.utoronto.ca/english-drama/i-joan",
      "detailed_info": {
        "title": "I, Joan",
        "description": "Charlie Josephine’s complete reimagining of the story of Joan of Arc upset some critics when it opened in London in 2022, but was celebrated by others, and by audiences, for its extraordinary, exuberant energy. This Joan is a non-binary person, fighting for their freedom as well as for France’s liberty from English rule, fueled by their utter belief in their mission (and its divine support), curbed by a small-minded establishment, but ultimately triumphant. A gloriously counterfactual, rivetingly theatrical rethinking of history by one of the most exciting voices in contemporary drama.",
        "date": "November 21 - November 30, 2024",
        "location": "Erindale Studio Theatre, University of Toronto Mississauga"
      }
    },
    {
      "Name": "U of T | National Day of Remembrance and Action on Violence Against Women",
      "URL": "https://www.svpscentre.utoronto.ca/2024/11/12/december-6-2024/",
      "detailed_info": {
        "title": "National Day of Remembrance and Action on Violence Against Women Dialogues for Grief and Action",
        "description": "On Friday, December 6, 2024, the University of Toronto will join communities across Canada to honour the lives of the 14 women killed at Montreal’s École Polytechnique in 1989. Join us in-person at the St. George campus, or online via YouTube, for this annual memorial and reflection. To mark the 35th anniversary of this devastating act of misogyny, we will join together in collective grief for all those lost to gender-based violence as we share a meal, remember those who were killed, and look towards a better future. This event will include a musical tribute, an awards presentation, a memorial led by the Faculty of Applied Science and Engineering, and facilitated roundtable discussions with your colleagues, classmates, and friends. We will close the event with a brief campus walk, where participants will have the option to lay a rose in commemoration.",
        "date": "December 6, 2024",
        "location": "St. George Campus, University of Toronto"
      }
    },
    {
      "Name": "BLACK STUDENT ENGAGEMENT The Link Up",
      "URL": "https://www.utsc.utoronto.ca/webapps/webforms/feeds/displayDetails?id=3&event_id=7838",
      "detailed_info": {
        "title": "BSE - \"Let's Talk\" - The Link Up",
        "description": "Join us for a meal and conversation. A space for black identifying students of Caribbean, West Indian and African decent or origin to meet, network, talk, unpack, learn and discuss social and global issues. Be a part of your community.",
        "date": "Thursday, November 28, 2024, 04:30 pm - 07:00 pm",
        "location": "MW 130"
      }
    },
    {
      "Name": "Rapid Resume Review: In-Person Drop-in",
      "URL": "https://www.utsc.utoronto.ca/webapps/webforms/feeds/displayDetails?id=1&event_id=8322",
      "detailed_info": {
        "title": "Rapid Resume Review: In-Person Drop-in",
        "description": "Rapid Resume Review is back at our new location at Sam Ibrahim Building, 5th Floor, IA5165. Meet Employment Peer Coaches & Get Your Resume Reviewed! In-person drop-in service No appointment necessary Get quick feedback on your resume, cover letter or LinkedIn profile Every day 11am-1pm (Academic Advising & Career Centre) Bring a paper copy of your resume or cover letter to get it reviewed quickly!",
        "date": "November 28, 2024, 11:00 am - 01:00 pm",
        "location": "Sam Ibrahim Building, 5th Floor, IA5165"
      }
    },
    {
      "Name": "(VIRTUAL) Lime Connect - Business/Finance Recruitment Reception",
      "URL": "https://www.utsc.utoronto.ca/webapps/webforms/feeds/displayDetails?id=1&event_id=8208",
      "detailed_info": {
        "title": "Virtual Information Session - Business/Finance Recruitment Reception",
        "description": "A virtual Business/Finance-focused recruitment event for early/experienced professionals with disabilities. Registration is now open! Register to attend by Thursday, November 21st at midnight PST. A recruitment opportunity designed with visible and non-visible disabilities in mind. Our partners Bell, Canada Life, CIBC, Deloitte, IBM Canada, OMERS, PwC Canada, Rogers, and TD are seeking to connect with Lime Network members for outstanding opportunities available for professionals at all stages of their career!! All candidates must register in advance via our online system for these events to be considered. Please Note that this is an External Info Session hosted by Lime Connect.",
        "date": "Thursday, November 28th 2024",
        "location": "Virtual"
      }
    },
    {
      "Name": "Rapid Resume Review: In-Person Drop-in",
      "URL": "https://www.utsc.utoronto.ca/webapps/webforms/feeds/displayDetails?id=1&event_id=8323",
      "detailed_info": {
        "title": "Rapid Resume Review: In-Person Drop-in",
        "description": "Rapid Resume Review is back at our new location at Sam Ibrahim Building, 5th Floor, IA5165. Meet Employment Peer Coaches & Get Your Resume Reviewed! In-person drop-in service. No appointment necessary. Get quick feedback on your resume, cover letter or LinkedIn profile. Bring a paper copy of your resume or cover letter to get it reviewed quickly!",
        "date": "Friday, November 29, 2024, 11:00 am - 01:00 pm",
        "location": "Sam Ibrahim Building, 5th Floor, IA5165"
      }
    },
    {
      "Name": "Should I CR/NCR or LWD My Course?",
      "URL": "https://www.utsc.utoronto.ca/webapps/webforms/feeds/displayDetails?id=1&event_id=8294",
      "detailed_info": {
        "title": "Should I CR/NCR or LWD My Course?",
        "description": "Are you wondering whether you should CR/NCR or LWD from a course? Attend this workshop to learn about: -CR/NCR and Late withdraw options -Impact on your program and degree requirement -Calculating what you need on your remaining assignments/tests/final -Impact on your overall cumulative GPA",
        "date": "Friday, November 29, 2024, 11:00 am - 12:00 pm",
        "location": "IA5170"
      }
    },
    {
      "Name": "Health and Wellness Cookbook",
      "URL": "https://harthouse.ca/events/health-and-wellness-cookbook/",
      "detailed_info": {
        "title": "NA",
        "description": "NA",
        "date": "NA",
        "location": "NA"
      }
    },
    {
      "Name": "Weekly Drop-In Program",
      "URL": "https://harthouse.ca/events/weekly-drop-in/2024/11/28/",
      "detailed_info": {
        "title": "NA",
        "description": "NA",
        "date": "NA",
        "location": "NA"
      }
    },
    {
      "Name": "Get Crafty!",
      "URL": "https://harthouse.ca/events/get-crafty-2024-25/2024/11/28/",
      "detailed_info": {
        "title": "NA",
        "description": "NA",
        "date": "NA",
        "location": "NA"
      }
    },
    {
      "Name": "Lord of the Flies",
      "URL": "https://harthouse.ca/theatre/show/lord-of-the-flies/2024/11/28/",
      "detailed_info": {
        "title": "NA",
        "description": "NA",
        "date": "NA",
        "location": "NA"
      }
    },
    {
      "Name": "Labour",
      "URL": "https://harthouse.ca/events/labour/2024/11/28/",
      "detailed_info": {
        "title": "NA",
        "description": "NA",
        "date": "NA",
        "location": "NA"
      }
    },
    {
      "Name": "ReWritten",
      "URL": "https://www.humanities.utoronto.ca/events/rewritten",
      "detailed_info": {
        "title": "ReWritten",
        "description": "The _ReWritten_ creative team will stage a performance, incorporating dance, live music, and projections. (Run time approximately 70 minutes). After the performance there will be a session Q & A about the performance and the team’s iterative creative process. Co-created by Matthew Cumbie and Tom Truss, _ReWritten_ reflects on the intimate relationship between nineteenth-century American writers Herman Melville and Nathaniel Hawthorne to explore queerness, history, intimacy, and the written word. The relationship between Hawthorne and Melville has been characterized as one of the most mysterious and fruitful friendships in American letters, yet the letters from Hawthorne to Melville are missing. _ReWritten_ springs from this historic gap and time-hops between then and now as an attempt to expand how we see ourselves in these stories. Through performances and community engagements, _ReWritten_ weaves together dance, music, visual art, projection, and text, and reimagines an intergenerational queer love story. Since 2019, _ReWritten_ artists have been coming together to create and cultivate this iterative, multi-disciplinary performance project. Over the years, _ReWritten_ has included residencies at the Bethany Arts Center (NY), Texas State University, Colby College (ME), Salem State University, the University of Texas El Paso, the Berkshire Pulse (MA), Dance Place (DC), and the international conference of the Melville Society (Paris, FR); site-specific explorations of Herman Melville’s farmhouse Arrowhead, developed in partnership with the Berkshire County Historical Society; workshops with local libraries and community centers; and more. This semester the _ReWritten_ project is coming to the University of Toronto as part of a collaboration with a University of Toronto Mississauga English & Drama course. This is possible through the generous support of the Jackman Humanities Institute Program for the Arts; The Centre for the Study of the United States Bissell-Heyd Research Fellowship; The University of Toronto Mississauga Office of the Vice-Principal, Research and Innovation; and the UTM and UTSG Departments of English.",
        "date": "Friday, November 29, 2024 7:00 pm to 9:00 pm",
        "location": "MiST Theatre 3359 Mississauga Rd, Mississauga, ON L5L 1C6"
      }
    },
    {
      "Name": "2024-25 UTM-JHI Annual Seminar: Medicine and theatre (2) Narrative Medicine Workshop",
      "URL": "https://www.humanities.utoronto.ca/events/2024-25-utm-jhi-annual-seminar-medicine-and-theatre-2-narrative-medicine-workshop",
      "detailed_info": {
        "title": "2024-25 UTM-JHI Annual Seminar: Medicine and theatre (2) Narrative Medicine Workshop",
        "description": "This seminar will feature a panel discussion with artists who have worked with themes of medicine, illness, and wellness on stage (e.g., Nick Green, playwright of _Casey and Diana_ [2023]). Student co-applicants will act as interviewers. Lunan Zhao, a member of the core group and Resident Doctor (family medicine) at U of T’s Faculty of Medicine, will also join the discussion as an additional interlocutor. [NB: As it is difficult for medical students to attend any extra-curricular events during the week, this particular seminar MAY be scheduled not for a Friday but a Saturday afternoon.] Lunch will be available from 12:30 p.m. onwards.",
        "date": "Friday, November 29, 2024 1:00 pm to 4:00 pm",
        "location": "Collaborative Digital Research Space (CDRS) MN 3230 1535 Outer Circle Rd Mississauga, ON L5L 1C6"
      }
    },
    {
      "Name": "Using GenAI Tools with Library Licensed Content",
      "URL": "https://www.humanities.utoronto.ca/events/using-genai-tools-library-licensed-content",
      "detailed_info": {
        "title": "Using GenAI Tools with Library Licensed Content",
        "description": "The integration of Generative Artificial Intelligence (GenAI) tools into the humanities is set to transform approaches to studying human culture and history. With the rapid evolution of GenAI tools and applications, the legal and policy frameworks governing GenAI use are full of grey areas and subject to change. This resulting uncertainty can create challenges in navigating the lawful use of these technologies for research and teaching. This workshop will introduce participants to questions that arise when integrating approved and non-approved GenAI tools into research and teaching. From there, the workshop will segue into a more focused discussion on copyright, using case studies to guide the conversation. By participating in the workshop, participants will gain a better understanding of the copyright and licensing concerns that govern the use of GenAI tools, as well as the library eResources that are available to support GenAI use. Along the way, participants will become familiar with: * U of T-recommended best practices for the use of open or closed GenAI tools, and the suitability of various kind of content in open or closed environments * Key copyright and licensing terminology to help participants understand their rights and obligations (and those of their students) * Answers to some common AI copyright and licensing questions.",
        "date": "Tuesday, December 10, 2024 1:00 pm to 3:00 pm",
        "location": "Room 100 Jackman Humanities Building 170 St. George St., Toronto, ON, M5R"
      }
    },
    {
      "Name": "Master of Nursing and Post-Master’s Admission Application Workshop",
      "URL": "https://bloomberg.nursing.utoronto.ca/event/master-of-nursing-and-post-masters-admission-application-workshop/",
      "detailed_info": {
        "title": "Master of Nursing and Post-Master’s Admission Application Workshop",
        "description": "Join our student services team for a workshop to learn more about the steps involved in an application to our Master of Nursing and Post-Master’s Nurse Practitioner program. Ask questions in advance by submitting our registration form at the link above.",
        "date": "November 29, 2024 | 12 PM – 1 PM",
        "location": "Online via Zoom"
      }
    },
    {
      "Name": "BScN Financial Information Session",
      "URL": "https://bloomberg.nursing.utoronto.ca/event/bscn-financial-information-session/",
      "detailed_info": {
        "title": "BScN Financial Information Session",
        "description": "Information about tuition fees, awards and scholarships for prospective applicants.",
        "date": "December 3, 2024 | 12 PM – 1 PM",
        "location": "Online via Zoom"
      }
    },
    {
      "Name": "MN/PMNP Financial Information Session (Awards, Scholarships, Funding)",
      "URL": "https://bloomberg.nursing.utoronto.ca/event/mn-pmnp-financial-information-session-awards-scholarships-funding/",
      "detailed_info": {
        "title": "MN/PMNP Financial Information Session (Awards, Scholarships, Funding)",
        "description": "Information about tuition fees, awards and scholarships for prospective applicants.",
        "date": "December 4, 2024 | 12 PM – 1 PM",
        "location": "Online via Zoom"
      }
    },
    {
      "Name": "Doctoral Financial Information Session (Awards, Scholarships, Funding)",
      "URL": "https://bloomberg.nursing.utoronto.ca/event/doctoral-financial-information-session-awards-scholarships-funding/",
      "detailed_info": {
        "title": "Doctoral Financial Information Session (Awards, Scholarships, Funding)",
        "description": "Information about funding packages, tuition fees, awards and scholarships for prospective applicants.",
        "date": "December 5, 2024 | 12 PM – 1 PM",
        "location": "Online via Zoom"
      }
    }
  ]
}