[
  {
    "Name": "U of T Big Data & Artificial Intelligence Competition Registration Deadline",
    "URL": "https://undergrad.engineering.utoronto.ca/event/u-of-t-big-data-artificial-intelligence-competition/",
    "detailed_info": {
      "title": "U of T Big Data & Artificial Intelligence Competition Registration Deadline",
      "description": "All U of T students with big data/AI experience are welcome to compete in the 2024-2025 IMI BIGDataAIHUB Big Data and Artificial Intelligence Competition! This competition is designed as a developmental opportunity for students to gain hands-on exposure to big data and artificial intelligence through real-world data – with the chance to win $30,000 in cash prizes. Entry is free and open to all U of T students. Please note that the competition is geared toward students with advanced programming and AI skills.",
      "date": "November 29, 2024",
      "location": "Online"
    }
  },
  {
    "Name": "Build Your Exam Plan Workshop",
    "URL": "https://undergrad.engineering.utoronto.ca/event/build-your-exam-plan-workshop-2/",
    "detailed_info": {
      "title": "Build Your Exam Plan Workshop",
      "description": "Ready to conquer exam season? Join our Build Your Exam Plan Workshop and discover how to craft a personalized study plan that works for you! Learn strategies to prioritize your test content, optimize your study time, and say goodbye to last-minute cramming!",
      "date": "December 2, 2024",
      "location": "Galbraith Building Room 202 (GB202), 35 St. George St"
    }
  },
  {
    "Name": "Last Day of Arts & Science Fall Term Classes",
    "URL": "https://undergrad.engineering.utoronto.ca/event/last-day-of-as-f-term-classes/",
    "detailed_info": {
      "title": "Last Day of Arts & Science Fall Term Classes",
      "description": "December 3, 2024, is the last day of Arts & Science lectures in the F-term. For the complete list of sessional dates, visit the Engineering Academic Calendar.",
      "date": "December 3, 2024",
      "location": "Faculty of Applied Science and Engineering, 35 St. George St. Toronto, Ontario, Canada M5S 1A4"
    }
  },
  {
    "Name": "Learning How To Learn: Preparing for Exams – Problem-Based Assessments",
    "URL": "https://undergrad.engineering.utoronto.ca/event/learning-how-to-learn-preparing-for-exams-problem-based-assessments/",
    "detailed_info": {
      "title": "Learning How To Learn: Preparing for Exams – Problem-Based Assessments",
      "description": "Conquer problem-based exams with confidence. In this workshop, learn planning and studying practices to tackle challenging problem-based assessments. Understand the way in which problem-based exams are structured, learn effective strategies for problem-solving and critical thinking, and develop an effective approach to practice and self-test as you prepare for exams. This workshop will be held online on Zoom.",
      "date": "December 3, 2024",
      "location": "Virtual via Zoom"
    }
  }
]