{
  "source_url": "https://undergrad.engineering.utoronto.ca/events/",
  "total_items": 18,
  "items": [
    {
      "Name": "U of T Big Data & Artificial Intelligence Competition Registration Deadline",
      "URL": "https://undergrad.engineering.utoronto.ca/event/u-of-t-big-data-artificial-intelligence-competition/",
      "detailed_info": {
        "title": "U of T Big Data & Artificial Intelligence Competition Registration Deadline",
        "description": "All U of T students with big data/AI experience are welcome to compete in the 2024-2025 IMI BIGDataAIHUB Big Data and Artificial Intelligence Competition! This competition is designed as a developmental opportunity for students to gain hands-on exposure to big data and artificial intelligence through real-world data – with the chance to win $30,000 in cash prizes. Entry is free and open to all U of T students. Please note that the competition is geared toward students with advanced programming and AI skills.",
        "date": "November 29, 2024",
        "location": "Online"
      }
    },
    {
      "Name": "Build Your Exam Plan Workshop",
      "URL": "https://undergrad.engineering.utoronto.ca/event/build-your-exam-plan-workshop-2/",
      "detailed_info": {
        "title": "Build Your Exam Plan Workshop",
        "description": "Ready to conquer exam season? Join our Build Your Exam Plan Workshop and discover how to craft a personalized study plan that works for you! Learn strategies to prioritize your test content, optimize your study time, and say goodbye to last-minute cramming!",
        "date": "December 2, 2024",
        "location": "Galbraith Building Room 202 (GB202), 35 St. George St"
      }
    },
    {
      "Name": "Last Day of Arts & Science Fall Term Classes",
      "URL": "https://undergrad.engineering.utoronto.ca/event/last-day-of-as-f-term-classes/",
      "detailed_info": {
        "title": "Last Day of Arts & Science Fall Term Classes",
        "description": "December 3, 2024, is the last day of Arts & Science lectures in the F-term. For the complete list of sessional dates, visit the Engineering Academic Calendar.",
        "date": "December 3, 2024",
        "location": "Faculty of Applied Science and Engineering, 35 St. George St. Toronto, Ontario, Canada M5S 1A4"
      }
    },
    {
      "Name": "Learning How To Learn: Preparing for Exams – Problem-Based Assessments",
      "URL": "https://undergrad.engineering.utoronto.ca/event/learning-how-to-learn-preparing-for-exams-problem-based-assessments/",
      "detailed_info": {
        "title": "Learning How To Learn: Preparing for Exams – Problem-Based Assessments",
        "description": "Conquer problem-based exams with confidence. In this workshop, learn planning and studying practices to tackle challenging problem-based assessments. Understand the way in which problem-based exams are structured, learn effective strategies for problem-solving and critical thinking, and develop an effective approach to practice and self-test as you prepare for exams. This workshop will be held online on Zoom.",
        "date": "December 3, 2024",
        "location": "Virtual via Zoom"
      }
    },
    {
      "Name": "Last Day of Engineering Fall Term Classes",
      "URL": "https://undergrad.engineering.utoronto.ca/event/last-day-of-engineering-fall-term-classes/",
      "detailed_info": {
        "title": "Last Day of Engineering Fall Term Classes",
        "description": "The last day of lectures for the U of T Engineering Fall Term will be December 4, 2024. All term work should be submitted by this date. Please note that the last day of classes is also the deadline for requesting a Late Withdrawal Without Documentation (LWD) for Fall Term courses. For the complete list of sessional dates, visit the Engineering Academic Calendar.",
        "date": "December 4, 2024",
        "location": "U of T Engineering"
      }
    },
    {
      "Name": "Makeup Monday / Fall Study Day",
      "URL": "https://undergrad.engineering.utoronto.ca/event/fall-study-day-2/",
      "detailed_info": {
        "title": "Makeup Monday / Fall Study Day",
        "description": "Makeup Monday is an optional instructional day held on December 5 and will be scheduled the same as a regular Monday. As such, instructors may use this day to make up for the missing Monday of Thanksgiving Day. If the instructor does not use Makeup Monday, this day will be used as a study day.",
        "date": "December 5",
        "location": "NA"
      }
    },
    {
      "Name": "Fall 2024 Engineering Exam Jam",
      "URL": "https://undergrad.engineering.utoronto.ca/event/fall-2024-engineering-exam-jam/",
      "detailed_info": {
        "title": "Fall 2024 Engineering Exam Jam",
        "description": "U of T Engineering’s Exam Jam for the 2024 Fall Term will be held on Thursday, December 5, 2024 from 9 a.m.–4 p.m. No registration is required, and all events are free of charge for first-year engineering students. We hope you’ll take advantage of some of these de-stressing and extra help opportunities: Review sessions with your first-year course instructors and/or TAs; Healthy free lunch for first-year students from 12–1 p.m.; Therapy Dog Visit from the St. John Ambulance Therapy Dog Program from 1–2 p.m.",
        "date": "December 5, 2024",
        "location": "Multiple Locations"
      }
    },
    {
      "Name": "Final Exam Period for the 2024 Fall Term",
      "URL": "https://undergrad.engineering.utoronto.ca/event/final-exam-period-for-the-2024-fall-term/",
      "detailed_info": {
        "title": "Final Exam Period for the 2024 Fall Term",
        "description": "F-term final exams will be held from December 6 to 21, 2024. Please note that U of T Engineering will hold exams on Saturdays, Sundays and evenings during the final exam period. More information about Engineering exams can be found on the Exam Schedules, Locations and Information page. Students with exam conflicts or religious observances at the end of the exam period may have their exam rescheduled for Sunday, December 22, as an accommodation.",
        "date": "December 6 - December 21, 2024",
        "location": "Faculty of Applied Science and Engineering, 35 St. George St. Toronto, Ontario, Canada M5S 1A4"
      }
    },
    {
      "Name": "URent: Finding a Place to Live",
      "URL": "https://undergrad.engineering.utoronto.ca/event/urent-finding-a-place-to-live/",
      "detailed_info": {
        "title": "URent: Finding a Place to Live",
        "description": "Join a free live session run by Housing Services to learn what’s involved in finding a place to rent in Toronto. They’ll offer a step-by-step guide to budgeting, finding roommates, securing safe and affordable housing, signing leases and more! This event is open to all University of Toronto students, staff, and faculty.",
        "date": "December 12, 2024",
        "location": "Online"
      }
    },
    {
      "Name": "Winter Break: University Closed",
      "URL": "https://undergrad.engineering.utoronto.ca/event/winter-break-university-closed-2/",
      "detailed_info": {
        "title": "Winter Break: University Closed",
        "description": "The University will be closed from December 24, 2024, to January 3, 2025, for the Winter Break. The University will re-open on January 6, 2025. Congratulations to all our students on completing your final exams and the Fall Term. We wish you a wonderful winter break! For the complete list of sessional dates, visit the Engineering Academic Calendar.",
        "date": {
          "start": "2024-12-24",
          "end": "2025-01-03"
        },
        "location": "University of Toronto"
      }
    },
    {
      "Name": "Winter Term Classes Begin",
      "URL": "https://undergrad.engineering.utoronto.ca/event/winter-term-classes-begin/",
      "detailed_info": {
        "title": "Winter Term Classes Begin",
        "description": "Welcome back from the Winter Break! Lectures for the U of T Engineering and Arts & Science S-term courses begin and Y-term courses resume on January 6, 2025.",
        "date": "January 6, 2025",
        "location": "Toronto, Ontario, Canada"
      }
    },
    {
      "Name": "UofTHacks 12",
      "URL": "https://undergrad.engineering.utoronto.ca/event/uofthacks-12/",
      "detailed_info": {
        "title": "UofTHacks 12",
        "description": "UofTHacks 12 is back and bigger than ever! Join this two-day hackathon from January 17 to 19, 2025 for a weekend full of coding, creativity, and collaboration. Whether you’re a seasoned hacker or a first-timer, this is your chance to innovate, learn, and connect! Be part of a vibrant community of over 500 hackers and collaborate on exciting projects. Hackathons are a great opportunity to practice your skills with hands-on workshops and receive mentorship from peers, as well as industry professionals.",
        "date": "January 17, 2025 - January 19, 2025",
        "location": "Myhal Centre, 55 St George St, Toronto"
      }
    },
    {
      "Name": "U of T Engineering Kompetition (UTEK)",
      "URL": "https://undergrad.engineering.utoronto.ca/event/u-of-t-engineering-kompetition-utek/",
      "detailed_info": {
        "title": "U of T Engineering Kompetition (UTEK)",
        "description": "The University of Toronto Engineering Kompetition (UTEK) is U of T’s oldest and largest engineering competition! Seven different competition categories span many fields of engineering and let competitors use a variety of skills to solve and prototype a problem. Winners will represent UofT to compete provincially at the Ontario Engineering Competition (OEC), and potentially nationally at the Canadian Engineering Competition (CEC). The 2025 theme is “Against All Offs.” This theme challenges you to rise above limitations, solve complex problems, and turn setbacks into opportunities.",
        "date": "January 18 to 19, 2025",
        "location": "Bahen Centre"
      }
    },
    {
      "Name": "Clarke Prize Environmental Design Challenge",
      "URL": "https://undergrad.engineering.utoronto.ca/event/clarke-prize-environmental-design-challenge/",
      "detailed_info": {
        "title": "Clarke Prize Environmental Design Challenge",
        "description": "The Clarke Prize is a weekend-long event exclusively for undergraduate engineering students (year 2+). Put your creativity and problem-solving skills to the test as you imagine new ideas to tackle real-world environmental challenges. Collaborate with peers, learn from experts, and turn innovative ideas into impactful solutions. In this intensive learning experience, you will evolve your teamwork skills and communication strategies. You will engage in a cumulative design challenge proposal and pitch before a panel of esteemed judges with the top prize of $10,000, a second-place prize of $7,000 and a third-place prize of $5,000. Applications for upper-year engineering students are open! The deadline to apply is Wednesday, December 4, 2024.",
        "date": "January 25, 2025 - January 26, 2025",
        "location": "Myhal Centre, U of T St. George Campus"
      }
    },
    {
      "Name": "UTRA Hacks",
      "URL": "https://undergrad.engineering.utoronto.ca/event/utra-hacks/",
      "detailed_info": {
        "title": "UTRA Hacks",
        "description": "UTRA Hacks is back for its 5th anniversary! If you’re interested in robotics, be sure to join this hackathon hosted by the U of T Robotics Association (UTRA) to experience innovation, creativity, and endless possibilities! Participants can connect face-to-face, collaborate with student peers and engage with industry leaders and mentors. Hackers of all experience levels can join workshops, tech talks, and career sessions to learn something new. UTRA Hacks will be providing the necessary equipment to participate.",
        "date": "February 1, 2025",
        "location": "To be announced"
      }
    },
    {
      "Name": "Winter Wellness Challenge Begins!",
      "URL": "https://undergrad.engineering.utoronto.ca/event/winter-wellness-challenge-begins/",
      "detailed_info": {
        "title": "The 2025 Winter Wellness Challenge",
        "description": "This challenge encourages students to participate in wellness activities while taking care of their mental, physical, and spiritual health.",
        "date": "February 3 to March 3, 2025",
        "location": "NA"
      }
    },
    {
      "Name": "The Hult Prize OnCampus Competition",
      "URL": "https://undergrad.engineering.utoronto.ca/event/the-hult-prize-oncampus-competition/",
      "detailed_info": {
        "title": "The Hult Prize OnCampus Competition",
        "description": "The Hult Prize OnCampus Competition is back! Whether you’re a seasoned startup ready to scale or an aspiring entrepreneur with a big idea, join a global community of changemakers. Each year, Hult Prize empowers students to create innovative startups that can create real impact. Participants join an exclusive global community of student entrepreneurs, mentors, and industry experts as they work to earn a spot in our Global Finals where finalists compete for $1M in funding to bring their big ideas to life. Registration are open until January 19, 2025, at 11:59 PM.",
        "date": "February 12, 2025",
        "location": "NA"
      }
    },
    {
      "Name": "Exam Accommodation Registration Deadline",
      "URL": "https://undergrad.engineering.utoronto.ca/event/exam-accommodation-registration-deadline-2/",
      "detailed_info": {
        "title": "Exam Accommodation Registration Deadline",
        "description": "If you are registered with Accessibility Services and would like to receive accommodation for the April exam period (April 9 – 30), you must register with Accommodated Testing Services (ATS) by March 14. Please note that late requests will only be considered due to highly exceptional and compelling circumstances. As such, we strongly recommend submitting this as early as possible to guarantee accommodation.",
        "date": "March 14, 2025",
        "location": "NA"
      }
    }
  ]
}